In [2]:
import pandas as pd

Importing CSV data

In [3]:
df = pd.read_csv('survey_results_public.csv')

df_survey = pd.read_csv('survey_results_schema.csv')
#df = pd.read_csv('survey_results_schema.csv')

In [4]:
#this is specific to pandas no reference to dataframe
pd.set_option('display.max_column',50)

In [5]:
#df.info() - list of column with name and datatype
df.head() #list sample record from df
df.shape # give number of rows and column in DF

(73268, 79)

In [6]:
df_survey.head(2)
df.head(2)

df_survey[['qname','type']]
df_survey.head(5)
#df_survey.set_index('qid', inplace=True)
#df_survey.reset_index(inplace=True)

,qid,qname,question,force_resp,type,selector
0,QID16,S0,"<div><span style=""font-size:19px;""><strong>Hel...",False,DB,TB
1,QID12,MetaInfo,Browser Meta Info,False,Meta,Browser
2,QID1,S1,"<span style=""font-size:22px; font-family: aria...",False,DB,TB
3,QID2,MainBranch,Which of the following options best describes ...,True,MC,SAVR
4,QID296,Employment,Which of the following best describes your cur...,False,MC,MAVR

In [7]:
#Conditional record search by using AND & /OR | operator
df_survey.loc[(df_survey['qname']=='S0') & (df_survey['qid']=='QID16')]

,qid,qname,question,force_resp,type,selector
0,QID16,S0,"<div><span style=""font-size:19px;""><strong>Hel...",False,DB,TB

In [8]:
#number of row and column along with column info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73268 entries, 0 to 73267
Data columns (total 79 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   ResponseId                      73268 non-null  int64
 1   MainBranch                      73268 non-null  object
 2   Employment                      71709 non-null  object
 3   RemoteWork                      58958 non-null  object
 4   CodingActivities                58899 non-null  object
 5   EdLevel                         71571 non-null  object
 6   LearnCode                       71580 non-null  object
 7   LearnCodeOnline                 50685 non-null  object
 8   LearnCodeCoursesCert            29389 non-null  object
 9   YearsCode                       71331 non-null  object
 10  YearsCodePro                    51833 non-null  object
 11  DevType                         61302 non-null  object
 12  OrgSize                         51039 non-null  object
 13  PurchaseInfluence               50969 non-null  object
 14  BuyNewTool                      67963 non-null  object
 15  Country                         71771 non-null  object
 16  Currency                        51264 non-null  object
 17  CompTotal                       38422 non-null  float64
 18  CompFreq                        44425 non-null  object
 19  LanguageHaveWorkedWith          70975 non-null  object
 20  LanguageWantToWorkWith          67027 non-null  object
 21  DatabaseHaveWorkedWith          60121 non-null  object
 22  DatabaseWantToWorkWith          51014 non-null  object
 23  PlatformHaveWorkedWith          49924 non-null  object
 24  PlatformWantToWorkWith          40415 non-null  object
 25  WebframeHaveWorkedWith          53544 non-null  object
 26  WebframeWantToWorkWith          46122 non-null  object
 27  MiscTechHaveWorkedWith          44992 non-null  object
 28  MiscTechWantToWorkWith          36810 non-null  object
 29  ToolsTechHaveWorkedWith         54171 non-null  object
 30  ToolsTechWantToWorkWith         46566 non-null  object
 31  NEWCollabToolsHaveWorkedWith    70347 non-null  object
 32  NEWCollabToolsWantToWorkWith    64108 non-null  object
 33  OpSysProfessional use           65503 non-null  object
 34  OpSysPersonal use               70963 non-null  object
 35  VersionControlSystem            71379 non-null  object
 36  VCInteraction                   68156 non-null  object
 37  VCHostingPersonal use           0 non-null      float64
 38  VCHostingProfessional use       0 non-null      float64
 39  OfficeStackAsyncHaveWorkedWith  46223 non-null  object
 40  OfficeStackAsyncWantToWorkWith  32072 non-null  object
 41  OfficeStackSyncHaveWorkedWith   62128 non-null  object
 42  OfficeStackSyncWantToWorkWith   47688 non-null  object
 43  Blockchain                      71071 non-null  object
 44  NEWSOSites                      71365 non-null  object
 45  SOVisitFreq                     70961 non-null  object
 46  SOAccount                       71572 non-null  object
 47  SOPartFreq                      58229 non-null  object
 48  SOComm                          71408 non-null  object
 49  Age                             70946 non-null  object
 50  Gender                          70853 non-null  object
 51  Trans                           70315 non-null  object
 52  Sexuality                       66565 non-null  object
 53  Ethnicity                       69474 non-null  object
 54  Accessibility                   67244 non-null  object
 55  MentalHealth                    66447 non-null  object
 56  TBranch                         52670 non-null  object
 57  ICorPM                          36283 non-null  object
 58  WorkExp                         36769 non-null  float64
 59  Knowledge_1                     35804 non-null  object
 60  Knowledge_2                     34973 non-null  object
 61  Knowledge_3                     35133 non-null  object
 62  Knowledge_4                     35097 non-null  object
 63  Knowledge_5                     35014 non-null  object
 64  Knowledge_6                     34991 non-null  object
 65  Knowledge_7                     34977 non-null  object
 66  Frequency_1                     35371 non-null  object
 67  Frequency_2                     35344 non-null  object
 68  Frequency_3                     34515 non-null  object
 69  TimeSearching                   36198 non-null  object
 70  TimeAnswering                   36022 non-null  object
 71  Onboarding                      35679 non-null  object
 72  ProfessionalTech                34906 non-null  object
 73  TrueFalse_1                     35819 non-null  object
 74  TrueFalse_2                     35715 non-null  object
 75  TrueFalse_3                     35749 non-null  object
 76  SurveyLength                    70444 non-null  object
 77  SurveyEase                      70508 non-null  object
 78  ConvertedCompYearly             38071 non-null  float64
dtypes: float64(5), int64(1), object(73)
memory usage: 44.2+ MB

In [9]:
#this set the number of columns or rows of the dataframe to be display
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_rows',6)
df

,ResponseId,MainBranch,Employment,...,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,...,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",...,Too long,Difficult,NaN
2,3,"I am not primarily a developer, but I write co...","Employed, full-time",...,Appropriate in length,Neither easy nor difficult,40205.0
...,...,...,...,...,...,...,...
73265,73266,"I am not primarily a developer, but I write co...","Employed, full-time",...,Appropriate in length,Easy,NaN
73266,73267,I am a developer by profession,"Employed, full-time",...,Appropriate in length,Easy,NaN
73267,73268,"I used to be a developer by profession, but no...","Independent contractor, freelancer, or self-em...",...,Appropriate in length,Easy,NaN

In [10]:
#Python dictionary to prepare manual dataset to create Pandas DataFrame
people = {
    'id': [1001,1003,1002,1004,1005,1006,1007,1008,1009,1010],
    'fname': ['Jack','Tom','Traci','Rosy','Jack','Jhon','Jenny','Tom','Raj','Terry'],
    'lname': ['Foly','Alter','Saw','Burk','jack@email','Dow','Dow','Hanks','Saurabh','Dow'], 
    'email': ['jack.foly@email','tom.alter@email','traci.saw@email','rosy.burk@email','jack@email','jhon.dow@email.com','jenny.dow@email.com','tom.hanks@email.com','saurabh.raj@email.com','td@email.com'],
    'country':['USA','UK','India','Canada','Germany','USA','USA','UK','India', 'USA'],
    'work mode': ['remote','work from home','office','head office','remote','office','Remote','office','work from home','Office'],
    'dept': ['IT','Sales','Marketing','Admin','Sales','Developer','Admin','Sales','VP','Finance'],
    'emp_type':['emp','cwx','emp','cwx','emp','emp','cwx','emp','emp','emp'],
    'language': ['English;French','Spanish;French;English','Dutch;English',
                 'Finish;English;Python','English;Hindi;Java:Spanish','English:SQL:Python',
                 'English;Unix','Hindi;Python-English','Dutch;Swiss;English','English'
                ]
         }

In [11]:
#Way to access python dictionary
people['email']

['jack.foly@email',
 'tom.alter@email',
 'traci.saw@email',
 'rosy.burk@email',
 'jack@email',
 'jhon.dow@email.com',
 'jenny.dow@email.com',
 'tom.hanks@email.com',
 'saurabh.raj@email.com',
 'td@email.com']

In [12]:
#Pandas dataframe is similar but proivde more functionality over data and can visulize more redable form

df_people = pd.DataFrame(people)

#access dataframe multiple column values
#df_people[['fname','lname']]
#df_people

In [13]:
pd.set_option('display.max_columns',10)
#accessing row using integer location iloc method, additionally you can locate range of records by using the : colon
#or use the list squar bracket to pass the record index to diaplay, remember end range number is excluded
df_people.iloc[1:4]

,id,fname,lname,email,country,work mode,dept,emp_type,language
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python

In [14]:
df_people.iloc[[1,2,3,4]]

,id,fname,lname,email,country,work mode,dept,emp_type,language
1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English
2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English
3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python
4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish

In [15]:
#listout the dataframe columns
df_people.columns

Index(['id', 'fname', 'lname', 'email', 'country', 'work mode', 'dept',
       'emp_type', 'language'],
      dtype='object')

In [16]:
#Info about DataFrame row index, starting row index and Df last record df 
df_people.index

RangeIndex(start=0, stop=10, step=1)

# Note: You can also access the df by dot notation, but be caucious when df column and method name are same in this case python will call method rather then column

if you have column name EMP as well as method EMP in this case python will use method or give error better use the brackets for best practice

# Each column in DataFrame is Series

In [153]:
#df_people.apply(pd.Series.count)
df_people

,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French,5000
1,1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English,1000
2,2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English,2000
3,3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python,3000
4,4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,4000
5,5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python,5000
6,6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix,6000
7,7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English,5500
8,8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,8000
9,9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,9000

In [18]:
#multiple column is not series type its again a df
#series is one diamentional array for one column and values
type(df_people[['fname','lname']])

pandas.core.frame.DataFrame

In [19]:
df_people.rename(columns={'work_mode':'work mode'}, inplace=True)

In [20]:
#access data frame column's
pd.set_option('display.max_rows',10)
df_people[['fname','email','work mode','id']]

   fname                  email       work mode    id
0   Jack        jack.foly@email          remote  1001
1    Tom        tom.alter@email  work from home  1003
2  Traci        traci.saw@email          office  1002
3   Rosy        rosy.burk@email     head office  1004
4   Jack             jack@email          remote  1005
5   Jhon     jhon.dow@email.com          office  1006
6  Jenny    jenny.dow@email.com          Remote  1007
7    Tom    tom.hanks@email.com          office  1008
8    Raj  saurabh.raj@email.com  work from home  1009
9  Terry           td@email.com          Office  1010

In [21]:
#filtering specific record from dataframe without loc or iloc
df_people[(df_people['work mode']=='remote') & (df_people['email']=='jack@email')] [['fname','lname']]
df_people[(df_people['work mode']=='remote') & (df_people['email']=='jack@email')] [['email','id']]

        email    id
4  jack@email  1005

In [22]:
# find minimum value from each column

df_people.apply(lambda x: x.min())

id                      1001
fname                   Jack
lname                  Alter
email        jack.foly@email
country               Canada
work mode             Office
dept                   Admin
emp_type                 cwx
language       Dutch;English
dtype: object

# value.counts() method can also be use as group by clause to group the data based on number of columns

In [23]:
#count the values 
#df_people.rename(columns={'work mode':'work_mode'}, inplace=True)
df_people[['fname','work mode']].value_counts()

fname  work mode
Jack   remote            2
Jenny  Remote            1
Jhon   office            1
Raj    work from home    1
Rosy   head office       1
Terry  Office            1
Tom    office            1
       work from home    1
Traci  office            1
dtype: int64

In [24]:
#get the percentage %age instead of count use the normalize = True
df_people[['fname','work mode']].value_counts(normalize=True)

fname  work mode
Jack   remote            0.2
Jenny  Remote            0.1
Jhon   office            0.1
Raj    work from home    0.1
Rosy   head office       0.1
Terry  Office            0.1
Tom    office            0.1
       work from home    0.1
Traci  office            0.1
dtype: float64

# rename DataFrame column name df.rename(columns = {old:new,}, inplace=True)

In [25]:
df_people.rename(columns = {'work mode':'work_mode'}, inplace=True)

In [26]:
df_people.reset_index(inplace=True)

In [155]:
#loc[row/[rows]], column/[columns] for range no need to use the list bracket
df_people.loc[[1,5], ['email','fname']]

                email fname
1     tom.alter@email   Tom
5  jhon.dow@email.com  Jhon

In [ ]:
df_people.set_index('id', inplace=True)

In [ ]:
#though index is changed to id but iloc still using the numerical index values
df_people.iloc[[1,2,0],[1,4,5]]

In [ ]:
df_people.columns

loc and iloc
#iloc and loc both reference to dataframe rows by index, iloc access integer index where loc access rows by label

# Query Dataframe Rows use the loc and iloc (iloc is integer location of row) and loc row label both point to row only
eg. if you have reset your default index(0-~)you can not give reference to filter row on index 0 or 1 because this index is no longer available, but you can still refer the loc which is label like record 1 or 10th record etc
iloc: search by row index
loc: search by label

In [ ]:

df.iloc[[0,2]]
#if we want email column for selected two row in this case use the column index outside list

df.iloc[[0,2],1:3]
#df

In [ ]:
#number of columns from selective row
df_people.loc[[0,2], ['email','fname','lname']]

In [ ]:
#dataframe column condition return the record with Boolean value for matching record True and rest False]- id is index here so don't get confuse
df_people['fname']=='Jack'

In [ ]:
df_people.set_index('fname', inplace=True)

In [ ]:
#now index is set for fname now you can use the loc on fname to find the records
df_people.loc['Jack']

In [ ]:
df_people.reset_index(inplace=True)

In [ ]:
df_people['lname']=='Dow'

In [ ]:
filt = df_people['lname']=='Dow'
#filt = df_people[df_people['lname']=='Dow'] direct dataframe values can not be used as filte
filt

In [ ]:
df_people.loc[filt]# you can also chooes the column values as needed

~ symbol reverse(negate) the condition, filt condition become not condition

In [ ]:
df_people.loc[~filt]# you can also chooes the column values as needed

In [ ]:
#filter can be used directly to dataframe as well as with loc
#as we know we can also chooes the number of columns we want from dataframe except specific row but loc provide option to 
#select the row along with column values

df_people[filt] [['id','fname','email']].value_counts()

In [ ]:
df_people.loc[filt, ['fname','lname','email']]

In [ ]:
df_people[df_people['lname']=='Dow']

# Pandas AND and OR Operators (& and |)

In [ ]:
df_filter = (df_people['fname']=='Jack') | (df_people['lname']=='Dow')

In [ ]:
df_people[df_filter]

In [ ]:
#Dataframe isin() method is used to pass the additional filter to dataframe

In [ ]:
country_filter = (df_people['country'].isin(['USA'])) & (df_people['lname']=='Dow')

In [ ]:
#same result for both method
df_people[country_filter]
df_people.loc[country_filter]

# isin() method to validate column values like Oracle in - df['column'].isin([cols value])

In [ ]:
country_filter1 = (df_people['country'].isin(['USA'])) & (df_people['lname']=='Dow') & (df_people['id'] < 1010)
df_people[country_filter1]

In [ ]:
type(country_filter1)

# Dataframe str.contains() method helps to find the specific text in the column
df['column'].str.contain(value)

In [ ]:
lang_fil = df_people['language'].str.contains('Spanish')
df_people.loc[lang_fil]

# Describe and max(), min() method

In [ ]:
df_people[['id','fname','country']].min()
#df_people['id'].max()

In [ ]:
#aggregate DF group by column mentioned
df_people[['fname','work_mode']].value_counts()

In [ ]:
df_people['id'].max()

In [ ]:
#Caution - extract mininum value from Each dataframe column
df_people.apply([pd.Series.min])

In [ ]:
#use list in case data needed in row else skip the squar bracket to get data in column
df_people.apply([lambda x: x.min()])

In [ ]:
#Operation on pandas Series
s = pd.Series([10,12,14,15,18])
a=18
print("Series max value is --> ",s.max())
if s.max()==a:
    print("Series value is equal to variable")

y = (x for x in range(1,20) if x==s.max())
y1 = [x for x in range(1,20) if x==s.max()]
print("value From generator matching Series is --> ", sum(y))
print("Object Y is: ", y, " and Object Y1 is ", type(y1))

In [ ]:
#describe the dataframe with basic mean medium std and %tile values for numerical fields
df_people.describe()

In [ ]:
#top 5 record use tail for top bottom records

df_people.head(5)

df_people.tail(5)

# Update Dataframe record values

In [ ]:
df_people[(df_people['lname']=='Dow') & (df_people['fname']=='Jenny')]

In [ ]:
#updating fname to Ronny

df_people.loc[(df_people['lname']=='Dow') & (df_people['fname']=='Jenny'),['fname','email']] = ['Ronny','ronny.dow@email.com']

In [ ]:
#if you know the index for the record you wish to change
#dataframe.loc[index,[column's-to-update]] = [new-column-value]
df_people.loc[6, ['fname','email']] = ['Rock','rock.dow@email.com']

In [ ]:
df_people.loc[df_people['emp_type']=='emp','emp_type'] = 'Emp'

In [ ]:
df_people

In [ ]:
df_people[~((df_people['fname']=='Rock') & (df_people['lname']=='Dow'))]

In [ ]:
df_people[(df_people['fname']=='Rock') & (df_people['lname']=='Dow')]

In [ ]:
#update two column by using index reference
df_people.loc[3,['lname','email']]= ['Dilt','rosy.dilt@email.com']

In [ ]:
#AT can also be use in place of loc --somehow giving error to update multiple column values but values are getting change i guess this ment only for 1 value

#df_people.at[3,['lname','email']]= ['Hanson','rosy.hanson@email.com']
df_people.at[3, 'lname'] = 'Hanson'

In [ ]:
#update column all value to upper or other operation

df_people['emp_type'] = df_people['emp_type'].str.upper()

# apply, map, applymap and replace method

In [ ]:
#here find the record and chooes the column and see the lenth of that column value
df_people.loc[df_people['email']=='td@email.com','fname']
df_people.loc[df_people['email']=='td@email.com','fname'].apply(len)

In [ ]:
df_people.loc[df_people['lname']=='Dow', 'email']

In [ ]:
df_people.loc[df_people['emp_type']=='cwx','emp_type'].str.upper()
#df_people['emp_type'] = df_people.loc[df_people['emp_type']=='cwx','emp_type'].apply(lambda x: x.upper())

#don't update the dataframe field value as this gives the all DF records with matching and non matching records and for non matching criteria value will update to NaN
dfp['emp_type'] =dfp.loc[df_people['emp_type']=='cwx','emp_type'].str.upper()

In [ ]:
dfp

In [ ]:
df_p = df_people['email'].str.upper()
#this will create new dataframe with selected values
df_p

In [ ]:
#update value for emp field
df_people.loc[df_people['emp_type']!='CWX','emp_type'] = 'Emp'

In [ ]:
df_people['emp_type'] = df_people['emp_type'].str.upper()
df_people

In [ ]:
df_people['emp_type'] = df_people['emp_type'].str.lower()
df_people

In [ ]:
people = {
    'id': [1001,1003,1002,1004,1005,1006,1007,1008,1009,1010],
    'fname': ['Jack','Tom','Traci','Rosy','Jack','Jhon','Jenny','Tom','Raj','Terry'],
    'lname': ['Foly','Alter','Saw','Burk','jack@email','Dow','Dow','Hanks','Saurabh','Dow'], 
    'email': ['jack.foly@email','tom.alter@email','traci.saw@email','rosy.burk@email','jack@email','jhon.dow@email.com','jenny.dow@email.com','tom.hanks@email.com','saurabh.raj@email.com','td@email.com'],
    'country':['USA','UK','India','Canada','Germany','USA','USA','UK','India', 'USA'],
    'work mode': ['remote','work from home','office','head office','remote','office','Remote','office','work from home','Office'],
    'dept': ['IT','Sales','Marketing','Admin','Sales','Developer','Admin','Sales','VP','Finance'],
    'emp_type':['emp','cwx','emp','cwx','emp','emp','cwx','emp','emp','emp'],
    'language': ['English;French','Spanish;French;English','Dutch;English',
                 'Finish;English;Python','English;Hindi;Java:Spanish','English:SQL:Python',
                 'English;Unix','Hindi;Python-English','Dutch;Swiss;English','English'
                ]
         }

In [ ]:
pdf = pd.DataFrame(people)

In [ ]:
pdf
#.loc[9, 'language'] = 'Zulu;English'

In [ ]:
(pdf['lname']=='Dow') | (pdf['fname']=='Tom')

In [ ]:
# this is good to filter the record but for update it will update for matching row but rest of them become NaN
pdf.loc[f, 'emp_type'].str.upper()

In [ ]:
a= None
b=np.nan

if a==b:
    print('Yes')
else:
    print('NaN and None is not equal')

In [ ]:
pdf['emp_type'] = pdf['emp_type'].str.lower()

In [ ]:
#delete dataframe -- result after executing given del statment 
del pdff

In [ ]:
#get the lenght of the field, remeber here email set as custome index to reference record default is integer index
pdf['fname'].apply(len)

In [ ]:
#This tell how many record each column have in DF, default axis is rows
pdf.apply(len)

In [ ]:
#this Tells DF have 9 Columns in each row, except index, incase custom index is set that will not count
pdf.apply(len, axis='columns')

In [ ]:
#minimum character in DF fname column, first is length and 2nd int is occurance as per 

#pdf.set_index('email', inplace=True)
pdf['fname'].apply(len).value_counts()
#pdf['fname'].max()

In [ ]:
pdf['fname']

In [ ]:
# Series min or max with apply() give you the min/max value of each column from dataset
#, since each column in dataset is Series
# remember to use the pd.Series which means apply the pandas Series min/max method on dataframe

pdf.apply(pd.Series.max)

In [ ]:
#Same can be done by using the lambda

pdf.apply(lambda x: x.max())

In [ ]:
pdf

In [ ]:
#change the value for column values we can use replace method
#update multiple row column values
pdf['lname']= pdf['lname'].replace({'Sharma':'Burk', 'Saurabh':'Kumar'})

In [ ]:
pdf.loc[[3,8]]

# Change column name or rename column name, use inplace=True to apply the change

In [ ]:
#pdf.rename(columns = {'id':'emp_id'}, inplace=True)
#update column header name DataFrame.replace(colums = {'existing_name':'new_name'})
pdf.rename(columns = {'id':'emp_id'})

In [ ]:
pdf

# Insert and update Records
# Handling Null value in Df
# dropna(axis=index/columns, how='all/any')
all= delete row or column when all values are null
any = delete row or column when any value in df is null/NaN

In [ ]:
import numpy as np
emp_data = {'fname': ['sample','Jack',np.nan,'Traci','Rosy','Jack','Jhon','NULL','Tom','Raj','Terry'],
            'lname': [np.nan,'Foly','NA',np.nan,'NA','jack@email','Dow','Dow','Hanks','Saurabh','Missing'], 
            'email': [np.nan,'jack.foly@email',None,'traci.saw@email','rosy.burk@email','jack@email','jhon.dow@email.com','jenny.dow@email.com','tom.hanks@email.com','saurabh.raj@email.com','td@email.com'],
            'age':[15,10,np.nan,11,23,45,65,43,2,4,None],
            'zip':[10001,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,'NA']
           }

In [ ]:
ndf = pd.DataFrame(emp_data)
pd.set_option('display.max_rows',12)
#display at least 12 rows for all DF its not only for this

In [ ]:
ndf
#ndf.loc[9]=None

In [ ]:
ndf=ndf.append({'full_name':'NAMissing None','fname':'NAKumar','email':'MissingNA@email.com','gender':None}, ignore_index=True)
ndf

In [ ]:
cond = ndf['email']=='MissingNA@email.com'

In [ ]:
ndf.drop(index=ndf[cond].index)

In [ ]:
ndf.replace({'MissingNA@email.com': 'noemp@email.com'}, inplace=True, method='bfill')

In [ ]:
ndf

In [ ]:
ndf.replace({None:'np.nan','Missing':np.nan,None:np.nan})

In [ ]:
#Replace dataset custom null/na/missing values
#remember if no dataframe column specified in this case it will search value in all DF columns for replacement

ndf.replace({'NA':np.nan, None:np.nan, 'Missing':np.nan})
#after reviewing DF changes, use inplace=True to make permanent changes in DF

# here entire zip field is dropped because of how='all' option, with 'any' option all df records will dropped because in df have NaN/None value in each column

In [ ]:
ndf.dropna(axis='columns', how='all')

#Conditionally deletion of rows and columns for
# Conditon 1 - eg. delete rows if lname or email is null
# here 'HOW" play important role to drop after evaluating the list of cols in subset if how set to all in this case conditon will evalueate all the subset cols needs to be null to drop from df check Condition 2

In [ ]:
ndf.dropna(axis='index', how='any', subset=['lname','email'])

In [ ]:
ndf.replace({'NA':np.nan, 'NULL':np.nan,None:np.nan})

In [ ]:
ndf

# condition 2 - drop row when lname and email both are missing

In [ ]:
ndf.dropna(axis='index', how='all', subset=['lname','email'])
# use inplace = True to update the dataframe with your changes

In [ ]:
# search  NaN value in DF

ndf.isna()

In [ ]:
#update NaN value with text or number
ndf.fillna("missing")
ndf.fillna(-1)

In [ ]:
#ndf.replace({-1,np.nan}, inplace=True)

ndf.dtypes

In [ ]:
#zip column in DF is object type reason being mathmatical function can not be performed
#in this case this column need to be cast to int / float to do that, first string or null values need to be handled

ndf['zip'].replace({'NA':0}, inplace=True)
ndf['zip'].astype(float)

In [ ]:
ndf['zip'].mean()

# ADD / Delete column from DataFrame

In [ ]:
#adding new column full_name

ndf['full_name'] = ndf['fname'] +' '+ ndf['lname']

In [ ]:
ndf

In [ ]:
#str.split method to re-add fname and lname column in df
ndf['full_name'].str.split(' ')

In [ ]:
#this will seperate the value in columns structure that can be addded to df in next 
ndf['full_name'].str.split(' ', expand=True)

In [ ]:
# Adding Two column in DF
ndf[['fname','lname']] = ndf['full_name'].str.split(' ', expand=True)

In [ ]:
ndf

In [ ]:
#add column in df
ndf['gender']=np.nan

In [ ]:
#add row use df.append(obj, ignore_index=True, sort=False/True)
ndf

In [ ]:
#insert record, Remember to assign the value to DF other wise insert will not take effect

ndf = ndf.append({'fname':'Rosy','lname':'Wakeford'}, ignore_index=True)

In [ ]:
#this is adding two column in DF
ndf1[['gender','full_name']]= [np.nan, ndf['fname'] + ' ' + ndf['lname']]

In [ ]:
ndf

# Merging dataset adding dataset inserting another dataset to main df

In [ ]:
#adding/combining dataframe 
#Use one of the DF to include those change otherwise this remain view only, eg. ndf = pd.append(df,ignore_index=True, sort=False)
pd.set_option('display.max_rows',33)
ndf = ndf.append(ndf1, ignore_index=True, sort=False)

In [ ]:
ndf1

# Drop column

In [ ]:
# Drop Columns
#drop fname and lname column from dataframe
#inplace=True to commit changes to DF

ndf.drop(columns = ['lname','fname'], inplace = True)

In [ ]:
ndf

# Drop Row

In [ ]:
ndf1.drop(index=7, inplace=True)

In [ ]:
# Delete row from Dataframe
ndf.drop(index=0, inplace=True)

In [ ]:
# 2nd way to use the filter or conditional deletion

fi = ndf['lname']=='Wakeford'
ndf[fi].index

In [ ]:
ndf.drop(index=ndf[fi].index, inplace=True)

In [ ]:
ndf

In [ ]:
# Delete column drop column
ndf1.drop(columns=['fname','lname'], inplace=True)

In [ ]:
ndf1

In [ ]:
#df_people.loc[df_people['lname']=='jack@email',['lname','email']] =['Son','jack.son@email.com']
#df_people['full_name'] = df_people['fname'] + ' ' + df_people['lname']
df_people

# Sort data in dataframe - two way sort index or short by column value
# use inplace=True to keep sorted data in DF

In [ ]:
#sort by Index you can sort in decending by making ascending = True
df_people.sort_index(ascending=False)

In [ ]:
#Ascending order is default sort order
df_people.sort_values(by=['fname'], ascending=False)

In [ ]:
df_people.sort_values(by=['fname','lname'], ascending=False)

In [ ]:
#complecate sort on different columns
#Use Case - sort first name asceding than lname decending order
df_people.sort_values(['fname','lname'], ascending=[False, True])

In [30]:
#adding column to DF
df_people['salary']=1000

In [131]:
#updating each column
df_people.loc[7,'salary']=5500
df_people.loc[0,'salary']=5000

In [87]:
df_people['salary']= (df_people['salary'] * df_people['salary'].index)

In [ ]:
df_people

In [ ]:
#top and bottom 5 rows
df_people['salary'].nlargest(5)

In [ ]:
# bottom 5 salary
#df_people['salary'].nsmallest(5).index.max()
df_people['salary'].nsmallest(5)

In [ ]:
#complete dataset with top and bottom 5

df_people.nlargest(5, 'salary')

In [ ]:
df_people.nsmallest(5, 'salary')

# Grouping and Aggregating

In [ ]:
df_people['salary'].median()

In [ ]:
df_people.sort_values('salary')

In [ ]:
#merged_df = ndf.append(df_people, ignore_index=True)

In [109]:
pd.set_option('display.max_columns',20)
df_people

,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French,0
1,1,1003,Tom,Alter,tom.alter@email,UK,work from home,Sales,cwx,Spanish;French;English,1000
2,2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English,2000
3,3,1004,Rosy,Burk,rosy.burk@email,Canada,head office,Admin,cwx,Finish;English;Python,3000
4,4,1005,Jack,jack@email,jack@email,Germany,remote,Sales,emp,English;Hindi;Java:Spanish,4000
5,5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python,5000
6,6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix,6000
7,7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English,5500
8,8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,8000
9,9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,9000

In [31]:
fil = df_people['country']=='USA'
df_people.loc[fil, ['emp_type','salary']].value_counts()

emp_type  salary
emp       1000      3
cwx       1000      1
dtype: int64

In [103]:
df_grp = df_people.groupby('country')

In [110]:
df_grp[['country','work_mode']].value_counts()

country  work_mode
Canada   head office       1
Germany  remote            1
India    office            1
         work from home    1
UK       office            1
         work from home    1
USA      Office            1
         Remote            1
         office            1
         remote            1
dtype: int64

In [111]:
#country, emp_type column become index when df_grp was created for groupby country, emp_type
#you can created partition the df for one column by grouping country
df_grp['dept'].value_counts()

country  dept
Canada   Admin        1
Germany  Sales        1
India    Marketing    1
         VP           1
UK       Sales        2
USA      Admin        1
         Developer    1
         Finance      1
         IT           1
Name: dept, dtype: int64

In [112]:
df_grp.get_group('India')

,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
2,2,1002,Traci,Saw,traci.saw@email,India,office,Marketing,emp,Dutch;English,2000
8,8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,8000

In [132]:
df_grp['salary'].mean().loc['USA']

6250.0

In [120]:
#composite group, point to understand - group act like composite key as default and group dataset based on key value

comp_grp = df_people.groupby(['country','emp_type'])

In [126]:
comp_grp.get_group(('USA','emp'))

,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
0,0,1001,Jack,Foly,jack.foly@email,USA,remote,IT,emp,English;French,0
5,5,1006,Jhon,Dow,jhon.dow@email.com,USA,office,Developer,emp,English:SQL:Python,5000
9,9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,9000

In [133]:
comp_grp['salary'].mean()

country  emp_type
Canada   cwx         3000.000000
Germany  emp         4000.000000
India    emp         5000.000000
UK       cwx         1000.000000
         emp         5500.000000
USA      cwx         6000.000000
         emp         6333.333333
Name: salary, dtype: float64

In [127]:
comp_grp['salary'].mean().loc['USA']

emp_type
cwx    6000.000000
emp    4666.666667
Name: salary, dtype: float64

In [139]:
comp_grp['salary'].mean().loc['India']

emp_type
emp    5000.0
Name: salary, dtype: float64

In [150]:
comp_grp['work_mode','salary'].mean().loc['USA','cwx']

/var/folders/l5/0hgvlxrn1q9cm7g8sk6xxnr00000gn/T/ipykernel_25336/3284867614.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  comp_grp['work_mode','salary'].mean().loc['USA','cwx']

salary    6000.0
Name: (USA, cwx), dtype: float64

In [163]:
filx = df_people[df_people['salary']>5000] 
df_people[(df_people['salary']>5000) & (df_people['language'].str.contains('English'))]

,index,id,fname,lname,email,country,work_mode,dept,emp_type,language,salary
6,6,1007,Jenny,Dow,jenny.dow@email.com,USA,Remote,Admin,cwx,English;Unix,6000
7,7,1008,Tom,Hanks,tom.hanks@email.com,UK,office,Sales,emp,Hindi;Python-English,5500
8,8,1009,Raj,Saurabh,saurabh.raj@email.com,India,work from home,VP,emp,Dutch;Swiss;English,8000
9,9,1010,Terry,Dow,td@email.com,USA,Office,Finance,emp,English,9000

In [ ]:
df_people['language'].